Practical No. 12 <br>
Title: Data Aggregation. <br>
Name : Tavhare Ruchita Sharad <br>
Roll No : 61 <br>

step No.1 - Import the Dataset.

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [10]:
df= pd.read_csv("retail sales dataset.csv")
df.head()

,Unnamed: 0,Sales_ID,Product_Category,Sales_Amount,Discount,Sales_Region,Date_of_Sale,Customer_Age,Customer_Gender,Sales_Representative
0,0,efc35a5f-e48c-4803-9f6d-ef32a60e1367,Movies,341.05,45.98,East Dianeport,2024-07-12,69.0,Male,Bruce Rodriguez
1,1,92a86e42-de42-4e0d-89f3-bbb0b7f354bd,Pet Supplies,594.71,29.59,North Linda,2024-05-07,32.0,Other,Patricia Pugh
2,2,1fbbdc48-f405-48f3-8274-750581552d26,Outdoor,351.90,49.78,Lake Josephmouth,2024-05-11,28.0,Other,Kevin Fuentes
3,3,1f329e7a-13f0-4518-9eeb-84815301d64c,Electronics,NaN,NaN,North Martinside,2024-09-02,NaN,NaN,Evelyn Price
4,4,6ef559dc-3e68-4009-9845-4bab54d897c6,Books,795.75,27.21,Michealshire,2024-05-02,21.0,Other,Joseph Chavez

In [12]:
df.tail()

,Unnamed: 0,Sales_ID,Product_Category,Sales_Amount,Discount,Sales_Region,Date_of_Sale,Customer_Age,Customer_Gender,Sales_Representative
99995,99995,d0834da2-570b-479b-b70d-4e665c1fcb95,Automotive,871.22,15.83,Sandramouth,2024-03-25,67.0,Male,Wendy Jacobs
99996,99996,2e13ead8-fff2-4359-ad58-5d13a7c8c158,Appliances,620.85,36.49,Deannastad,2024-01-07,51.0,Female,Kevin Bradshaw
99997,99997,1ff153ec-41cc-4b5d-b000-e5967cdea9a9,Sports,479.04,29.01,Lake Brookeshire,2024-05-03,56.0,Other,Isaac Harrell
99998,99998,71e2a83e-52cc-4fe1-884c-0aaece400573,Office Supplies,419.56,9.60,Port Raymond,2024-01-28,43.0,Male,Austin Brown
99999,99999,2cb374f6-7e40-4905-86dc-42d68bd73d19,DIY,NaN,NaN,North Diane,2024-06-03,NaN,NaN,John Jones

Step No2. - Explore the Dataset.

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 421570 entries, 0 to 421569
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Store         421570 non-null  int64
 1   Dept          421570 non-null  int64
 2   Date          421570 non-null  object
 3   Weekly_Sales  421570 non-null  float64
 4   IsHoliday     421570 non-null  bool
dtypes: bool(1), float64(1), int64(2), object(1)
memory usage: 13.3+ MB

In [10]:
df.describe()

          Unnamed: 0  Sales_Amount      Discount  Customer_Age
count  100000.000000  90000.000000  90000.000000  90000.000000
mean    49999.500000    550.170806     24.913682     43.532544
std     28867.657797    260.134483     14.438750     15.008287
min         0.000000    100.010000      0.000000     18.000000
25%     24999.750000    324.970000     12.400000     30.000000
50%     49999.500000    550.095000     24.890000     44.000000
75%     74999.250000    776.020000     37.390000     57.000000
max     99999.000000   1000.000000     50.000000     69.000000

In [12]:
df.shape

(100000, 10)

In [14]:
df.columns

Index(['Unnamed: 0', 'Sales_ID', 'Product_Category', 'Sales_Amount',
       'Discount', 'Sales_Region', 'Date_of_Sale', 'Customer_Age',
       'Customer_Gender', 'Sales_Representative'],
      dtype='object')

In [16]:
df.dtypes

Unnamed: 0                int64
Sales_ID                 object
Product_Category         object
Sales_Amount            float64
Discount                float64
Sales_Region             object
Date_of_Sale             object
Customer_Age            float64
Customer_Gender          object
Sales_Representative     object
dtype: object

Step No.3 - Identify relevant variables.

In [19]:
df['Sales_Region'].unique()

array(['East Dianeport', 'North Linda', 'Lake Josephmouth', ...,
       'East Deannabury', 'West Vincentmouth', 'Lake Brookeshire'],
      dtype=object)

In [21]:
df['Sales_Amount'].describe()

count    90000.000000
mean       550.170806
std        260.134483
min        100.010000
25%        324.970000
50%        550.095000
75%        776.020000
max       1000.000000
Name: Sales_Amount, dtype: float64

In [23]:
df['Product_Category'].unique()

array(['Movies', 'Pet Supplies', 'Outdoor', 'Electronics', 'Books',
       'Automotive', 'Office Supplies', 'DIY', 'Groceries', 'Toys',
       'Tools', 'Beauty', 'Clothing', 'Software', 'Appliances', 'Sports',
       'Music', 'Garden', 'Personal Care', 'Furniture', 'Health',
       'Jewelry', 'Home & Kitchen', 'Baby Products'], dtype=object)

In [25]:
# Step No.4 - Group sales data by region and calculate total sales amount.
sales_by_region = df.groupby('Sales_Region')['Sales_Amount'].sum().reset_index()
sales_by_region

        Sales_Region  Sales_Amount
0          Aaronberg       4534.26
1       Aaronborough        879.53
2         Aaronburgh          0.00
3          Aaronbury       2232.60
4       Aaronchester       1477.30
...              ...           ...
38102  Zunigaborough          0.00
38103     Zunigabury          0.00
38104     Zunigafort        730.81
38105     Zunigaland       1035.07
38106    Zunigamouth        264.15

[38107 rows x 2 columns]

Step No.5 - Create bar plots or pie charts to visualize the sales distribution by region

In [ ]:
# Bar plot
plt.figure(figsize=(10, 6))
plt.bar(sales_by_region['Sales_Region'], sales_by_region['Sales_Amount'])
plt.xlabel('Sales Region')
plt.ylabel('Total Sales Amount')
plt.title('Sales Distribution by Region')
plt.xticks(rotation=45)
plt.show()

In [ ]:
# Pie chart
plt.figure(figsize=(8, 8))
plt.pie(sales_by_region['Sales_Amount'],labels=sales_by_region['Sales_Region'],
autopct='%1.1f%%')
plt.title('Sales Distribution by Region')
plt.show()